---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendingDetailType.SegmentLengthDimensionTextPosition
source: html/9c72522b-3366-ee6b-c0a6-68f45830fe58.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.SegmentLengthDimensionTextPosition Property

Identifies the text position with respect to dimension line.

## Syntax (C#)
```csharp
public BendingDetailDimensionTextPosition SegmentLengthDimensionTextPosition { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration